{
  "recipeTitle":"Lemon curd",
  "description":"<p>Cakes can get quite sweet and I use sour citrus to cut through that sweetness. I developed this recipe specifically for using as a filling in cakes, and that's why this lemon curd will be a bit more stable than your usual lemon curd. Some lemon curd recipes only use the eggs to thicken the lemon curd, but my recipe also uses gelatin to make it even thicker, which wil allow you to have a thicker layer of lemon curd in your cake.</p><p>Cakes can also be very filling as heavy whipping cream and butter contains a lot of fat. To help balance the flavours in a cake that will have other fat-heavy components (like mousses or buttercream), I make my lemon curd with a little less fat than your standard lemon curd. Less butter maintains the acidity of the lemons, which when combined with other cake components creates a balanced cake. More butter will mellow the acidity, so if you want a more mellow lemon curd and a more buttery mouth-feel go ahead and add some extra butter.</p>",
  "ingredients":[
    {"name": "gelatin sheet",
    "amount": 1},
    {"name": "lemon zest",
    "amount": 2,
    "unit": "tbsp" },
    {"name": "lemon juice",
    "amount": 1,
    "unit": "dl" },
    {"name": "egg",
    "amount": 1},
    {"name": "egg yolks",
    "amount": 2},
    {"name": "caster sugar",
    "amount": 2,
    "unit": "dl" },
    {"name": "cold butter",
    "amount": 70,
    "unit": "g" }
  ],
  "instructions":[
"Cut the butter into small cubes and refrigerate.",
"Put the gelatin sheet in cold water",
"Mix all ingredients except for butter and gelatin in a metal bowl and put over slighly simmering water. Constantly stir the mixture and sides of the bowl, using a spatula, until the mixture thickens. This happens at around 72&#176;C. Do <strong>not</strong> let the temperature surpass 80&#176;C or you will end up with scrambled eggs. Be careful not to introduce too much air into the mixture or it may turn a mousse-like consistency, which is not the goal.",
"Strain the mixture into another bowl.",
"Add the gelatin and stir to incorporate.",
"Add the butter a little at a time and stir to incorporate.",
"Cover the lemon curd with plastic wrap, touching the surface, and let cool."
  ],
"tags": ["dessert", "lemoncurd", "lemon", "lemon curd"],
"imgRelPath": "../img/recipes/desserts/lemoncurd-407x612.jpg",
"thumbnailImgRelPath": "../img/recipes/thumbnails/desserts/lemoncurd-thumb.jpg",
"imgAlt": "Lemon curd in a jar"
}