{
  "recipeTitle":"My basic sourdough bread",
  "description":"The recipe for my basic sourdough bread is more about guidelines and ratios than an actual recipe. This is because sourdough bread baking (and most bread baking) is all about ratios between ingredients and what you are aiming for. When baking bread I use baker's math. This means that all ingredients are thought of as ratios in relation to the amount of flour used. Hydration is a concept related to baker's math, which is the amount of water in the recipe expressed as a percentage of the weight of flour used. For example, if I make a bread with only white flour which has 12% protein (I will explain this more), then I usually choose 75% hydration. This means that if I have 1000g flour I'll have 750g of water, because 750/1000 is 0.75 or 75%. The more water you have the more fluffy and airy the crumb will be (bigger holes). If less water is used the crumb of your final bread will be tighter.<br> Another important aspect which relates to hydration is the amount of protein in the flour. Protein is the foundation for gluten, and it is what holds your bread together. Gluten is created when the protein of the flour mixes with water. The more gluten you have, the stronger your dough will be and the more air it can hold. So the more protein you have, the more gluten can be made. This is why a high-protein flour gives you a strong dough. Because water binds to the protein to create gluten, a high-protein flour can hold more water. This is why I use a higher hydration when I use a flour with a lot of protein. If I use a flour with 14% I will choose a hydration of 80%. This will create a dough with roughly the same consistency as a 12% protein flour at 75% hydration. <br> Another aspect of the flour to consider is if it is whole grain or not. Whole grain flour can hold more water than white flour, which is why I always increase hydration when incorporating whole grain flours. <br> All of this said, I'll provide my basic plain flour recipe with an hydration level for two airy loaves where the dough will not be too sticky, but you might need to experiment to find the right hydration levels for your specific flour and the crumb you want. My recipe uses 75% hydration, 20% starter and 2% salt",
  "ingredients":[
    {"name": "white flour",
    "amount": 1000,
    "unit": "g"},
    {"name": "sourdough starter",
    "amount": 200,
    "unit": "g" },
    {"name": "salt",
    "amount": 20,
    "unit": "g" },
    {"name": "water",
    "amount": 750,
    "unit": "ml/g"}
  ],
  "instructions":[
"Mix all ingredients together except for the salt. Start with the water and add the flour to it for easier mixing. You may use a tool or a machine, but I usually use my hands. Note the time you mixed it all together.",
"After 30 min, add the salt. I find the easiest way to mix the dough at this point is using the <a href='' >slap and fold method</a>.",
"After another 30m min make some <a href='https://www.youtube.com/shorts/QC-6rskOq8I'>coil folds</a> until the dough barely stretches under its own weight. Do this with wet hands to prevent the dough sticking to your hands. Do <strong>NOT</strong> add any flour at this step. Some people prefer the <a href='https://www.youtube.com/watch?v=Qzx7dxuvaCo'>stretch and fold method</a>, but I prefer the coil fold as it is more gentle which means you won't pop any bubbles that have formed(but either works!). This is a step to give the dough strength.",
"Let rise for another 3-7 hours, until the dough has incread about 50% in size. Most yeast recipes says to let the dough double in size, but sourdough is different and may not be as powerful leaveners as industrial yeast, and we do not want to risk over-prooving our dough. The time depends on the temperature in the room and the strength and vitality of your starter.",
"Turn the dough onto a slightly wet workbench with wet hands. Again, <strong>NO</strong> flour at this time. Use a bench scraper to divide the dough into two equal parts. Loosely shape each dough into a ball <a href='https://www.youtube.com/shorts/xyRMwbUUbZg'>like this</a>, this is called pre-shaping. powder with flour and let rest for 15 min.",
"Next, flour your <a href='https://www.kingarthurbaking.com/blog/2023/01/25/bannetons-brotforms-proofing-baskets'>proofing baskets</a>. Alternatively, if you don't have one, you can use a bowl and put a kitchen towel in it, which must be covered in flour as well.",
"Shape the dough into a round boule again or a <a href='https://www.kingarthurbaking.com/blog/2022/01/18/how-to-shape-a-batard'>batard</a>, depending on the shape of your proofing basket. Put the shaped dough into the proofing baskets.",
"Let rise again, either a few more hours in room temp or over night in the fridge. The dough is ready when it springs back half-way when you poke it with a finger. If it springs back immediately it is not ready yet. If the dough does not spring back at all it is over-proofed.",
"About 1 hour before you think the dough is ready, turn your oven on 230&#176;C, with a cast iron pan or a baking steel/stone for pre-heating. Bake for 15 min with steam and then another 15 (or until you like the color) without steam. For baking with steam, if using a cast iron pan simply put the lid on. If using a baking steel or stone use a baking sheet with a couple dl of water. Do not forget to remove the lid/pan after 15 min if you want a crackeling outer shell on your loaves."
  ],
"tags": ["bread", "sourdough"],
"imgRelPath": "../img/recipes/bread/sourdoughBread.webp"
  
}